[
  "Id: 01KGP23TCNBA2HE1SAVCE1WW7Y\nDateString: 2026-02-07T15:00:00.000Z\nPrivacy: link\nSpeakers: yusheng kuo, Andriy Vovchak\nSentences: yusheng kuo: Oh, okay.\nyusheng kuo: Okay.\nAndriy Vovchak: It's like 10, nine here.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: Oh, Austin.\nyusheng kuo: Yeah, my kid is next to me, so yeah.\nAndriy Vovchak: Nice, nice, nice.\nAndriy Vovchak: Is he, how old is he?\nyusheng kuo: I have a seven and a two.\nAndriy Vovchak: Wow.\nyusheng kuo: Okay.\nyusheng kuo: What about you?\nAndriy Vovchak: I'm married, so I have my wife now.\nAndriy Vovchak: We got married one year and a few months ago, like.\nAndriy Vovchak: No, it was August 2024.\nAndriy Vovchak: We bought an apartment.\nAndriy Vovchak: We also want to have family here in Estonia and.\nAndriy Vovchak: But yeah, slowly getting there indeed.\nAndriy Vovchak: Like, you know, like first you get married, you buy your own place.\nAndriy Vovchak: Yeah, yeah, yeah, yeah, yeah, the usual things.\nAndriy Vovchak: But you, how are you.\nAndriy Vovchak: So what's your situation now like in terms of employment also?\nAndriy Vovchak: Are you like working full time?\nyusheng kuo: Yeah, yeah, I'm now like working on this full time, kind of bootstrapping that and we'll see like how far we can go if I need to go back to like corporate or.\nyusheng kuo: Yeah.\nyusheng kuo: Or.\nyusheng kuo: Yes, like early success.\nyusheng kuo: But yeah, that's what we are, what we are looking for.\nyusheng kuo: And yeah.\nyusheng kuo: So.\nyusheng kuo: So I've been going full time for almost like seven months, eight months.\nyusheng kuo: Yeah.\nAndriy Vovchak: Interesting.\nAndriy Vovchak: Interesting.\nyusheng kuo: Yeah.\nAndriy Vovchak: Nice.\nyusheng kuo: Yeah, definitely not.\nyusheng kuo: Definitely.\nyusheng kuo: Yeah.\nyusheng kuo: Kind of not, not a most comfortable time, but yeah, it's, it's fine.\nyusheng kuo: I mean I, I have a bit of a savings so it's not terrible.\nyusheng kuo: Okay.\nyusheng kuo: I wouldn't, I wouldn't be like, like oh, I don't have food tomorrow.\nyusheng kuo: But yeah, just.\nyusheng kuo: And then I have a bit of a. Yeah, like.\nyusheng kuo: Yeah, just bit of a funding save up.\nyusheng kuo: But we'll see, we'll see how far we can go.\nyusheng kuo: Okay.\nyusheng kuo: Okay.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Okay.\nyusheng kuo: Good, good.\nAndriy Vovchak: But are you having like some ping users already or how is it going?\nyusheng kuo: Yeah, we have a little bit.\nyusheng kuo: Yeah.\nyusheng kuo: And then we are in talk with some more like enterprise C, like SMB user.\nyusheng kuo: But we are also trying to see.\nyusheng kuo: Okay.\nyusheng kuo: How can we kind of get some kind of breakthrough.\nyusheng kuo: But first we just really need to pin down who would like to use it and what's like a real user profile that can find the most value out of it.\nyusheng kuo: So that's the number one thing we need to kind of figure it out.\nAndriy Vovchak: Understood.\nAndriy Vovchak: Understood.\nAndriy Vovchak: Understood.\nyusheng kuo: Yeah.\nAndriy Vovchak: Okay.\nyusheng kuo: Okay.\nyusheng kuo: How's.\nyusheng kuo: How's the new agency going?\nyusheng kuo: So you joined like a friend or.\nAndriy Vovchak: Yeah, it's, it's crazy because I just joined these guys here because well actually like the, the other, the other, the other job, This other company was.\nAndriy Vovchak: It's really like going.\nAndriy Vovchak: I don't know, like I sense that, that things are not that good already like somewhere in November and they joined like beginning of July and they Said like, okay, whoa, this is, this is getting a bit crazy because it's like that there is no revenue.\nAndriy Vovchak: Like I mean we've been like working on this for, for so long.\nAndriy Vovchak: They've been working there like for nine years and a half.\nAndriy Vovchak: What's going on?\nAndriy Vovchak: And nevertheless we were sold this sort of a dream by the head of revenue who like head of revenue was hired in January 2025, head of marketing somewhere in February 2025.\nAndriy Vovchak: Then I got executive in June 2025 and I joined like first day of July 2025.\nAndriy Vovchak: So we were like like completely new team but had a experienced people and, and we like took this as a challenge.\nAndriy Vovchak: Okay.\nAndriy Vovchak: This is completely like it's going really bad.\nAndriy Vovchak: Everything is really bad.\nAndriy Vovchak: RAM is empty.\nAndriy Vovchak: There is no defined like scope and how to get there.\nAndriy Vovchak: Money can be running out quite soon, like within a year or a year and a half.\nAndriy Vovchak: So we need to.\nyusheng kuo: You mean Avocado, right?\nyusheng kuo: You mean Avocado?\nAndriy Vovchak: Yeah, in Avocado.\nAndriy Vovchak: Yeah, yeah, yeah, there.\nAndriy Vovchak: So what happened is that we said okay, we need to fix this.\nAndriy Vovchak: What can we do?\nAndriy Vovchak: How can we do it?\nAndriy Vovchak: And we tried our best really to, to get this, this work.\nAndriy Vovchak: But we noticed even from CEO, CEO and from the like the co founder was like more towards product.\nAndriy Vovchak: There was no help.\nAndriy Vovchak: There was even not that much interest in what we were doing.\nAndriy Vovchak: Like there was like, you know, when they leave you alone like doing your stuff, it's one thing, but there is, when there is neglect towards what you're doing, towards how it's going, it's pretty bad.\nAndriy Vovchak: And we were like a bit alarmed and that's why I left.\nyusheng kuo: I see.\nAndriy Vovchak: Yeah.\nyusheng kuo: Yeah.\nyusheng kuo: So they are only going to wind down pretty soon.\nAndriy Vovchak: You mean possibly most likely the head of marketing is gonna, is going to leave end of February ahead of revenue.\nAndriy Vovchak: Is really looking for a new job, account executive also.\nAndriy Vovchak: So I don't know what they're going to do.\nyusheng kuo: But yeah, I feel this is a old school like a UI based sass.\nyusheng kuo: Like this one will be the first ones that can get pretty complicated.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: Because now there are a lot of like contra legal platform.\nyusheng kuo: We just kind of naturally expand into this space.\nyusheng kuo: Like a country intelligence platform.\nyusheng kuo: Yeah.\nAndriy Vovchak: And there are like well funded ones.\nAndriy Vovchak: There is huge one in, in Sweden.\nAndriy Vovchak: Like really founded like yes, like highly professional team and it's.\nAndriy Vovchak: And they are growing like crazy.\nAndriy Vovchak: And then there is far away as well.\nAndriy Vovchak: I think it's from Harvey.\nAndriy Vovchak: Harvey?\nyusheng kuo: Yeah, yeah, yeah.\nAndriy Vovchak: It's from the States, it's maybe from Europe or something.\nAndriy Vovchak: There like anyway like well founded best talents and true.\nyusheng kuo: Yeah yeah.\nyusheng kuo: How long this thing asking like how long is this product?\nyusheng kuo: Hey.\nAndriy Vovchak: Well they've been trying to.\nAndriy Vovchak: The.\nAndriy Vovchak: The company started like nine years ago.\nyusheng kuo: Yeah, you mentioned that right?\nAndriy Vovchak: Yeah but it's like not fitting into anything.\nAndriy Vovchak: Like they tried SMBs but there is not as much money.\nAndriy Vovchak: They tried the HR with contract management but still like there are HR solutions for there and there is not as much money.\nAndriy Vovchak: HR doesn't have any money especially.\nAndriy Vovchak: Especially right now.\nAndriy Vovchak: And then you have.\nAndriy Vovchak: Then we went to the banks and the most structured companies but the buying Cycle is like one year, one year and a half or telecommunication companies, really structured IoT companies but it's really like one year, one year AND a half.\nAndriy Vovchak: So what you do don't close.\nAndriy Vovchak: You don't close anyway.\nyusheng kuo: Yeah yeah yeah.\nAndriy Vovchak: So that's, that's been like really the, the situation a bit.\nyusheng kuo: Yeah yeah.\nyusheng kuo: So yeah, yeah yeah.\nyusheng kuo: So yeah let's.\nyusheng kuo: Let's get into what we, what we can do like try to discuss what's the kind of a possibility of like how can we kind of combine.\nyusheng kuo: I think the high level would be like how do we combine combine the power of cloud code with the power of play.\nyusheng kuo: I think there are two direction.\nyusheng kuo: I'm kind of very interested.\nyusheng kuo: That one is like you once like you mentioned kind of iteratively like recursively improving yourself.\nyusheng kuo: Yeah.\nyusheng kuo: And then the other one is how can I actually don't repeat myself.\nyusheng kuo: That's another area I'm interested.\nyusheng kuo: It's okay you because yesterday I also talked to an agency he said like okay I every time he kind of strategizes in cloud code because you have an agent right.\nyusheng kuo: So take the intel form and then would do all the deep research and create a context repository.\nyusheng kuo: So and also like Jeff top the strategy.\nyusheng kuo: But then after this strategy you always have to like re implement everything into play like click by click.\nyusheng kuo: So yeah so that's like the like you also mentioned that right.\nyusheng kuo: You kind of do something in cloudco pretty quick and then have to do like a nine table to build it in clay.\nyusheng kuo: But I think clay is kind of important because he also mentioned like whenever he go more than like 1500 roads like Cloudco kind of not really be able to like enrich like one by one.\nyusheng kuo: So one area.\nyusheng kuo: So that's another area I'm very interested in.\nyusheng kuo: I can try to show what I got for the second use case.\nAndriy Vovchak: Yeah I can, I can.\nAndriy Vovchak: I will be like super curious because then I'm gonna build this.\nAndriy Vovchak: I Kind of have like a framework of presentation that I would like to build because I'm gonna give you some context.\nAndriy Vovchak: I was invited for by this Italian guy.\nAndriy Vovchak: By the way, I speak Italian because I lived in Italy for almost my entire life.\nAndriy Vovchak: It's my first time.\nAndriy Vovchak: So it's.\nAndriy Vovchak: So if you saw in the screenshot like Italian.\nAndriy Vovchak: That's why I just.\nyusheng kuo: Okay.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: The thing is that he.\nAndriy Vovchak: He said like hey, let's.\nAndriy Vovchak: We are doing this meetup and if you want to come over and to have a good chat, that would be great and even showing some presentation, it would be nice.\nAndriy Vovchak: So I'm going to tell you this.\nAndriy Vovchak: I can.\nAndriy Vovchak: I can organize.\nAndriy Vovchak: What are you using?\nAndriy Vovchak: Is this exclusial?\nyusheng kuo: This one?\nAndriy Vovchak: I just.\nyusheng kuo: I can.\nyusheng kuo: Yeah, I really like this one.\nAndriy Vovchak: I just opened Myro for.\nAndriy Vovchak: For the.\nAndriy Vovchak: For the purpose of this.\nAndriy Vovchak: But let me.\nAndriy Vovchak: Let me just quickly, really quickly show how I think about things.\nyusheng kuo: Oh yeah, yeah, sure.\nyusheng kuo: Sorry.\nAndriy Vovchak: I want to just say.\nAndriy Vovchak: So this is how I would like to present it.\nAndriy Vovchak: And by the way, this is thing one, thing two is that in the agency already like introduced like what we should be doing with cloud code and how.\nAndriy Vovchak: But they are still like keep it in their early stages especially because there are not that many extremely technical people.\nAndriy Vovchak: They're really skilled in strategy advisory.\nAndriy Vovchak: But getting into this nitiquity is a bit difficult anyway.\nAndriy Vovchak: Like yeah, here is how I think of things.\nyusheng kuo: Yeah.\nAndriy Vovchak: Context building and then querying and so asking for insights.\nAndriy Vovchak: So I hear it.\nAndriy Vovchak: I think of it like this term.\nAndriy Vovchak: There is a strategy, operations and execution.\nAndriy Vovchak: Strategy is literally like what do we do in Q1, which campaign should we be running for this guy?\nAndriy Vovchak: Which is the.\nAndriy Vovchak: Which one is the next.\nAndriy Vovchak: This is a requirement.\nAndriy Vovchak: There is like you must build context in a way or in another you must have it.\nAndriy Vovchak: And then you just basically can talk to your cloud code and to decide okay, should we do this?\nAndriy Vovchak: Okay, yeah, anything.\nAndriy Vovchak: So for operations and then executions, here is where it gets a bit blurry.\nAndriy Vovchak: Operations, this is.\nAndriy Vovchak: What does it mean is like which Automation.\nAndriy Vovchak: I think operations into automation should be built meaning something that runs in the background then can be triggered or has a time that is like.\nAndriy Vovchak: That is a time that basically activates it.\nAndriy Vovchak: And yeah, calling agents.\nAndriy Vovchak: This is how we think about build CC and.\nAndriy Vovchak: And then you have like execution which is mostly like build me the copy or build me the.\nyusheng kuo: I mean like a final like thing that you do.\nAndriy Vovchak: Yeah, indeed, indeed.\nAndriy Vovchak: This is really like specific.\nAndriy Vovchak: This is mostly like.\nAndriy Vovchak: I would like to think about.\nAndriy Vovchak: I'm thinking this in Terms of mostly like these are skills that you almost build, like prep for the demo.\nAndriy Vovchak: Okay.\nyusheng kuo: Or.\nAndriy Vovchak: I don't know, research tech stack by calling like maybe one tool and then another tool, you know.\nAndriy Vovchak: So this is, this is how I see it basically.\nAndriy Vovchak: And this is how I try to explain it also to my new colleagues.\nAndriy Vovchak: So let me know like what you think of this also.\nyusheng kuo: Yeah, yeah, I think that's very valid.\nyusheng kuo: The thing is kind of a bury like you saying it's like where's the line between like the operation and execution?\nyusheng kuo: Like what do you think is part of like operations.\nyusheng kuo: Yeah, I think this is the part I'm not super understand what's separate.\nAndriy Vovchak: Yeah, I think that operations is something that operations is like let's say this way we build.\nAndriy Vovchak: We build.\nAndriy Vovchak: I don't know like we built like five agents and let's say that agent one is dedicated to.\nyusheng kuo: Build.\nAndriy Vovchak: Be.\nAndriy Vovchak: I don't know, like clean database, clean company, clean company info, find company info, clean cleaned input.\nAndriy Vovchak: And then for example here I'm thinking of.\nAndriy Vovchak: This becomes like, this becomes something like.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: And then there is an output and then there is a flow that is like activated through the, through the agents.\nAndriy Vovchak: Like we build five ages, clean, clean the input and provide an output which is then used in play or anything.\nAndriy Vovchak: Doesn't matter.\nAndriy Vovchak: But the only thing that this like in strategy, people use cc.\nyusheng kuo: Yeah.\nyusheng kuo: Yeah, almost exclusively.\nyusheng kuo: Yeah.\nAndriy Vovchak: Three to four.\nyusheng kuo: Yeah.\nAndriy Vovchak: This is like used for CC for three to four hours during a session.\nAndriy Vovchak: The.\nAndriy Vovchak: The goal is having an output.\nAndriy Vovchak: Yeah, here the goal is having really an output.\nAndriy Vovchak: What do we do?\nAndriy Vovchak: What do we want to.\nAndriy Vovchak: Don't we don't.\nAndriy Vovchak: Don't we do.\nAndriy Vovchak: And here on the other hand, when it comes to like the operation side of things, then here the goal becomes a bit of.\nAndriy Vovchak: Having agents running in the background.\nAndriy Vovchak: Like here how I see in the background while.\nAndriy Vovchak: Yeah, basically like running in the background.\nAndriy Vovchak: I can give you an example of this.\nAndriy Vovchak: Like I have built on clay.\nAndriy Vovchak: I have built.\nAndriy Vovchak: Basically it took me literally 10 tables, maybe even more just because like the.\nAndriy Vovchak: This, this client has a bunch of that they.\nAndriy Vovchak: That they get from a provider on the Swiss companies.\nAndriy Vovchak: So basically they have all this information but they need to take them.\nAndriy Vovchak: And there are for example three websites sometimes, you know.\nyusheng kuo: Yeah.\nAndriy Vovchak: And they need.\nAndriy Vovchak: And they need to identify which one is the actually the one related to the Swiss entity because we need that one.\nAndriy Vovchak: So I need to first look if they exist at all and then I need to.\nAndriy Vovchak: If they.\nAndriy Vovchak: I need to validate them and then I need to find the One that is related to the Swiss agency and if I don't find any, then I need to find one related to the, the Swiss agency and then you need to do the same for the LinkedIn account and then one, once that is done then you need to find the people that are in the Swiss HQ because these are big enterprises.\nAndriy Vovchak: Imagine they are in Germany, Switzerland, France and Austria.\nAndriy Vovchak: So this flow, this is an operations problem.\nAndriy Vovchak: So how can I build an agent that basically doesn't consume 10 tables?\nAndriy Vovchak: Because it's literally like a same tables.\nAndriy Vovchak: How can I do it in, in an agent which is called.\nAndriy Vovchak: And then I have an output and then for example the people search, they don't play.\nAndriy Vovchak: I think that yeah here execution is a bit of a different problem because here again like here is running in the background.\nAndriy Vovchak: Like let's say that this is running in the background and this is.\nyusheng kuo: One.\nAndriy Vovchak: Task of one or two hours done by a specialist.\nyusheng kuo: I see.\nyusheng kuo: Yes, yes, yes.\nyusheng kuo: Yeah I think, I think it's now, now it's clear.\nyusheng kuo: Yeah, I think especially like operation, I think execution.\nyusheng kuo: Yeah there are many things that can be, can be done here.\nyusheng kuo: Like I'm even thinking like this whole thing can become like a service that been sold to the enterprise.\nyusheng kuo: You know, like you have that, this like a repository set up for them and that become their almost kind of their own data.\nyusheng kuo: Right.\nyusheng kuo: And then you provide this skill they can use like they can come in, maybe they have some technical people and then you basically have set up all this required skill for that and then just like one call and you can also set up those kind of background agent running.\nyusheng kuo: What we are doing now actually I'm working with the user like he had a client and then we just basically set up this background agent for them using cloudcode.\nyusheng kuo: So the idea is like they set up, we set up some cloud code and then we deployed that.\nyusheng kuo: So they were like around automatically.\nyusheng kuo: So the client doesn't need to know what agent is being used.\nyusheng kuo: Right.\nyusheng kuo: But they would always just get the fresh data and then they can like talk to the data because of the agent being deployed.\nyusheng kuo: So it's like more reach providing than just like typical outbound service.\nyusheng kuo: So they, we provide not just the outbound but also like intelligence to your customer and then you can like talk to your customer, build up the context.\nAndriy Vovchak: This is so important what you're saying because now we are hitting the limit of.\nAndriy Vovchak: Outbound is not the thing that agencies want to offer anymore or they offer it on a condition.\nAndriy Vovchak: They offer it.\nAndriy Vovchak: I, I, I, I'm telling You.\nAndriy Vovchak: Because I was like in contact with many and so they basically telling you, okay, we're going to do Albon for you, but you need to have a huge stem.\nAndriy Vovchak: You need to have a clear case studies.\nyusheng kuo: Clear case studies.\nAndriy Vovchak: And you need to have like product market fit.\nyusheng kuo: It's like a commodity.\nyusheng kuo: Right.\nyusheng kuo: I have a 10 that.\nyusheng kuo: Yeah, of course there are, I know there is a pain like any agency can do it.\nAndriy Vovchak: Yeah, but, but, but that is the thing.\nAndriy Vovchak: And in our agency, I'm telling you, these guys, I joined them, it's been working for them for two, two days.\nAndriy Vovchak: They're super smart contracts are really high in value even for Switzerland.\nAndriy Vovchak: But you know, like Switzerland and United States, you're almost like pairing in terms of well, how much money people spend for these type of projects.\nAndriy Vovchak: But the thing is that they are really clear and really thorough.\nAndriy Vovchak: They are telling you, listen, we are now onboarding a client.\nAndriy Vovchak: Listen, we know that you want just album, but we need to do more to go and gather that.\nAndriy Vovchak: Yeah, we need to build intelligence layer as you mentioned, to go and build content for you to warm up.\nAndriy Vovchak: Also the type of buyers that are not ready but you need to understand them.\nAndriy Vovchak: You need to create content.\nAndriy Vovchak: You need to be able to create content.\nAndriy Vovchak: Even after a year that we spoke to each other.\nyusheng kuo: Yeah.\nAndriy Vovchak: And then of course we were going to do also album for you.\nAndriy Vovchak: We're going to define the acp, we're going to study the data and so on.\nAndriy Vovchak: And but as you said, it is a commodity.\nAndriy Vovchak: So true intelligence is the most important thing.\nAndriy Vovchak: And talking to your data, understanding what's in it.\nAndriy Vovchak: In it.\nAndriy Vovchak: Like how can I build an icp?\nAndriy Vovchak: What kind of next campaign can I build?\nAndriy Vovchak: So yeah, please take it away.\nAndriy Vovchak: And I'm super.\nAndriy Vovchak: I would love to dig into this a lot.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: So let me also try to show on my end something we build.\nyusheng kuo: I have two case here.\nyusheng kuo: So the way it's just kind of a high level is like the way people kind of do nowadays very similar to what you do.\nyusheng kuo: Like they, they kind of brainstorm and like strategizing in cc.\nyusheng kuo: Right.\nyusheng kuo: And then now they will like after they have some understanding they will try to like.\nyusheng kuo: Implement in clay for example.\nyusheng kuo: Yeah, that's like you say like it will be like a one by one and then there will be kind of like running like the recurring.\nAndriy Vovchak: Yeah, recurring.\nyusheng kuo: Yeah, yeah, recurring action.\nyusheng kuo: That's actually clay is good at.\nyusheng kuo: But what we are thinking is like okay, what if you like brainstorm and strategizing cloud code.\nyusheng kuo: Because this part is like very Time consuming, right?\nyusheng kuo: Like time consuming and hard to scale.\nyusheng kuo: And like.\nyusheng kuo: But you can use the same data source and then like implement or one customer for example.\nyusheng kuo: One prospect for example.\nyusheng kuo: And then in cloud code instead of in Clay.\nyusheng kuo: Right.\nyusheng kuo: And then the idea is then you try to blend in this.\nyusheng kuo: There's another chart I can show is like here.\nyusheng kuo: So we treat Clay as like parallel runner engine, right?\nyusheng kuo: Yeah.\nyusheng kuo: And before like a player's parallel engine runner and you have bunch of cables built up and.\nyusheng kuo: And then you have result.\nyusheng kuo: What we're thinking is that if you already kind of strategizing in CAL code.\nyusheng kuo: Right.\nyusheng kuo: And then now you can implement like for one in kau.\nyusheng kuo: So like one row, one row of like a calcul implementation and then you just deploy this cloud code.\nyusheng kuo: Deploy this cloud code to this table and then let Clay run that for 100 and thousands of them to get the result.\nyusheng kuo: So you don't need to like.\nyusheng kuo: So you don't no longer need to like a few hands on in cloud in Clay but also let cloud play.\nyusheng kuo: Yes.\nyusheng kuo: Okay.\nyusheng kuo: Let Clay handle the whole like for example like running in parallel, queuing the run handle the retry everything.\nyusheng kuo: So cloud code become like an intelligence layer and Clay become like a trigger dev almost.\nyusheng kuo: You can think of Clay have the trigger dev and also you have all the data show up.\nyusheng kuo: And here's some other nice thing like a list building or like integration to Slack or integration to instantly so on so forth.\nyusheng kuo: But the intelligence layer now try to be built in Clay.\nyusheng kuo: I have this example.\nyusheng kuo: So here's.\nAndriy Vovchak: I see you're using codon cursor basically.\nyusheng kuo: Yeah, I typically use the ghosted but I feel like to explain it's easier to use cursor.\nyusheng kuo: Okay, I will.\nyusheng kuo: I will take down my voice.\nyusheng kuo: Yes.\nyusheng kuo: So what this one do is actually you can see I'm doing that for a user.\nyusheng kuo: He's adding his working on Haycare.\nyusheng kuo: So we build up some kind of a contacts and then we have an agent and see this agent md.\nyusheng kuo: So this agent.\nyusheng kuo: Yeah, so this agent MD have this input schema.\nyusheng kuo: Right.\nyusheng kuo: So the idea is we will by deploying.\nyusheng kuo: By deploying this cloud code, we deploy the webhook and then the Clay can just call it and then create a result.\nyusheng kuo: So Clay doesn't need to like basically like we.\nyusheng kuo: We replace the whole of this thing with this content with this agent fault basically.\nyusheng kuo: And let me go back.\nyusheng kuo: So this agent have a pipeline and I use.\nyusheng kuo: I don't know if you follow Vercel's recent publishment a publication about.\nyusheng kuo: Don't Use scale file.\nyusheng kuo: Use this like your cloud md with a link file.\nyusheng kuo: I can send you the reference.\nyusheng kuo: So each of this is a step.\nyusheng kuo: Yeah, yeah, yeah.\nyusheng kuo: So just give me one.\nyusheng kuo: One.\nyusheng kuo: Yeah.\nyusheng kuo: So you can see there's a.\nAndriy Vovchak: They're so cute.\nAndriy Vovchak: They're so cute.\nAndriy Vovchak: Mandarin, right?\nAndriy Vovchak: It's the language.\nAndriy Vovchak: You're speaking Mandarin?\nyusheng kuo: Yes, yes.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: I'm from Taiwan.\nyusheng kuo: Yeah.\nyusheng kuo: So.\nyusheng kuo: So this is like a step one would be.\nyusheng kuo: It's like you can see that there's a company data.\nyusheng kuo: Actually there is a.\nyusheng kuo: The corresponding step file here.\nAndriy Vovchak: Yeah.\nyusheng kuo: To describe how to do this company data.\nAndriy Vovchak: Oh wait, you're not sharing anymore.\nAndriy Vovchak: Wait a second.\nAndriy Vovchak: Am I right?\nAndriy Vovchak: Yeah, yeah, yeah.\nAndriy Vovchak: You're radio.\nyusheng kuo: Let me show you again.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: Cool, cool.\nyusheng kuo: I. I used three tricks here to make it kind of reliable.\nyusheng kuo: So first is like break it down to step by step.\nyusheng kuo: So that's a one thing good.\nyusheng kuo: It's like okay, if you see any stuff, it's not good and good you can just come in here and then here's showing what's the input.\nyusheng kuo: It would be the LinkedIn URL and I use the parallel web research as a backup.\nyusheng kuo: So this is so intelligent.\nyusheng kuo: This would be like so many steps that I need to build in clay.\nyusheng kuo: You haven't I first tried this then if now I can do this, it would just handle that for me and then tell me what data should extract.\nyusheng kuo: What's the example output of it?\nyusheng kuo: Everything is like JSON file.\nyusheng kuo: And there's a step two is like finding the HR head.\nyusheng kuo: Because for this particular campaign you have to find the HR head and like it's using this parallel search web.\nAndriy Vovchak: Wait a second, you're using parallel there?\nyusheng kuo: Yeah, I'm using parallel.\nyusheng kuo: Sorry.\nAndriy Vovchak: Insane.\nAndriy Vovchak: Okay, so so basically you're able to find the company information because your company.\nAndriy Vovchak: So the steps is that in the agent the step one was the company data.\nAndriy Vovchak: So you basically find the company data.\nAndriy Vovchak: Step two, once you have found the company data, you're able to run this one.\nAndriy Vovchak: But how is this like parallel web search preview?\nAndriy Vovchak: Okay.\nyusheng kuo: Okay.\nyusheng kuo: Yeah.\nyusheng kuo: So it actually use many different tool.\nyusheng kuo: Like for example this one, it first tries to use the get linking company data which is the tool we have.\nyusheng kuo: So this is very accurate, like the real time result.\nyusheng kuo: But sometimes if the company doesn't have a linking presence.\nyusheng kuo: Right.\nyusheng kuo: Or I have the issue of the LinkedIn company data data source, then I can use this as a backup.\nyusheng kuo: So it doesn't just do web research like here again it's using like linking person data.\nyusheng kuo: And then like for example Kanunu.\nyusheng kuo: Because you need to.\nyusheng kuo: I don't know if you know Kanunu.\nyusheng kuo: I didn't know that actually cloud code tell me that because in dach area like I use like a firecross scrap to go to that website and scrap it.\nyusheng kuo: And then finally there's a score.\nyusheng kuo: Score like one.\nyusheng kuo: It's like here's all the data collection pipeline and like when I get to the score, I just ask agent to reason it, right?\nyusheng kuo: Because I mean cloud code I can ask agent to look not just at one row, but like a whole row of the whole column of the the contacts and try to answer the question for me.\nyusheng kuo: Like, okay, if it's EAP and so you can kind of reasoning and he can kind of come up with the angle with like, okay, what kind of play you should do?\nyusheng kuo: And then by separate that one by one.\nyusheng kuo: You just can easily like modify it and then run.\nyusheng kuo: Even run the very eye loop of.\nyusheng kuo: Okay, because you have a specific like go specific like output, right?\nyusheng kuo: So you can, you can just run that output format.\nyusheng kuo: You can give it like a fake input.\nyusheng kuo: And then I say okay, if I give you this input, what will be the output look like?\nyusheng kuo: And you can just tune the prompt for each different step and then you can do it in parallel actually.\nyusheng kuo: Right?\nyusheng kuo: Because like calculate do it.\nyusheng kuo: Okay, so let's go back to this agent imd.\nyusheng kuo: So those are like just a step by step.\nyusheng kuo: So that's the first thing.\nyusheng kuo: Break it down by step by step.\nyusheng kuo: And then you can see there is actually the dependency.\nyusheng kuo: It means you can actually run it.\nyusheng kuo: So they all will try to wait for step one, but once the step one is over because this thing can be running in parallel.\nyusheng kuo: Actually there's a parallelization part coming that cloud code will actually.\nyusheng kuo: I don't know if you know that.\nyusheng kuo: I can show you.\nyusheng kuo: Here's a kind of example.\nyusheng kuo: Your CAL code actually run it like that.\nyusheng kuo: There's a task list recently released in 1.33.\nyusheng kuo: It's like it will actually create this task list.\nyusheng kuo: Yeah.\nyusheng kuo: So you were like now they have this kind of agents.\nyusheng kuo: One thing I would just spin up.\nyusheng kuo: So even like a long step they don't lose track because they would just like go on and like do it in a very efficient way.\nyusheng kuo: Like in parallel.\nyusheng kuo: Like he doesn't really follow out I after a while I do three.\nyusheng kuo: See he tried to do like four and seven at Sunshine and then like.\nyusheng kuo: And then he will wait for like this finish to do because he said this by block by four and seven.\nyusheng kuo: So one, four and seven.\nyusheng kuo: I can finish.\nyusheng kuo: He will start by nine and then they won't stop 10 until nine finish.\nAndriy Vovchak: Okay, okay, okay.\nAndriy Vovchak: Okay.\nyusheng kuo: So that, that make very reliable pipeline creation.\nyusheng kuo: That's like very efficient.\nyusheng kuo: Yeah.\nyusheng kuo: And then eventually after we just saved the file.\nyusheng kuo: And another trick is like that's very powerful in KAL code compared to other like cloud AI agent is you can save all the intermediate context into like a file system.\nyusheng kuo: So it doesn't like cram up your whole pipeline.\nyusheng kuo: Like whole context means that everything will just be saved into the local file.\nyusheng kuo: And then if you have like so you can.\nyusheng kuo: So first it doesn't cram up, but it also leaves the trace for the later on when I in step 10 I need to review all the data I can come into here to read it like one by one.\nyusheng kuo: Like I already built up this whole context myself.\nyusheng kuo: Yeah, it's a very different way of thinking like building clay.\nyusheng kuo: I can.\nyusheng kuo: CLAY is like you have to like manually extract some information here.\nyusheng kuo: Right.\nyusheng kuo: And then, and then build a context window for clay agency to come up with some kind of angle.\nAndriy Vovchak: Yeah, that's why this is, this is when I was explaining to you like the part of the big problematic part of play which is becoming now problematic.\nAndriy Vovchak: And I'm telling you because for example, I need to keep building, building, building, building, building campaigns.\nAndriy Vovchak: Like for example, just recently I had to build specific campaigns for something.\nAndriy Vovchak: We were in the uae, United Arab Emirates and we were trying to understand, okay, we have a set of companies, but we need to study them because like the input from.\nAndriy Vovchak: From the client was a bit vague.\nAndriy Vovchak: Like they gave us references, but we need to go to the nitty gritty.\nyusheng kuo: Yeah.\nAndriy Vovchak: And the big issue was that we have all these companies but now, now we need to study them.\nAndriy Vovchak: Just we need to download them again and to re run.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Like we have a bunch of.\nAndriy Vovchak: We need to run all the descriptions that we have like on.\nAndriy Vovchak: On clay.\nAndriy Vovchak: You know, you get the descriptions from LinkedIn but also by clay sometimes.\nAndriy Vovchak: And then you need to fill them in if they're missing.\nAndriy Vovchak: But now you need to understand them and then you need to go up and redeploy and decide which ones to go.\nAndriy Vovchak: Yeah, you need to.\nyusheng kuo: And you have to worry about dependency.\nyusheng kuo: Right.\nyusheng kuo: Like how do you set up each crown?\nAndriy Vovchak: Yes, yes, you need to study them and then you need to run a logic of if this then that and which ones are going to stop them.\nAndriy Vovchak: But you need to, you need to set up a clay agent basically to say like, okay, I want only this, so I need to burn credits Is great to some extent in this parallelization and the action towards them.\nAndriy Vovchak: Well to.\nAndriy Vovchak: To the campaigns like sequence years but for the rice I'm really like a bit.\nAndriy Vovchak: So yeah, this, this was the big thing.\nAndriy Vovchak: Can you.\nAndriy Vovchak: Can you show me a bit more?\nAndriy Vovchak: I don't know, you're not showing your screen anymore.\nAndriy Vovchak: Like if we can.\nyusheng kuo: Oh really?\nyusheng kuo: Oh sorry.\nyusheng kuo: Yeah, it's.\nAndriy Vovchak: No, no worries, no worries.\nyusheng kuo: Yeah.\nyusheng kuo: Let me actually turn off my camera, video camera because it's like consume too much bandwidth for me.\nAndriy Vovchak: Oh yeah.\nyusheng kuo: Yeah.\nyusheng kuo: Okay.\nyusheng kuo: So.\nyusheng kuo: So actually yeah, so this is just making basically in one this row it kind of automatically create a contract about this whole company and then let this agent come in to review this company because they have the data kind of being scrapping down.\nyusheng kuo: So you can easily use the same angle and just ask it like cloud code to just change something and then you can immediately start a new campaign.\nyusheng kuo: And also a very important thing is because we want to have a structured output in the end so we can see all the data properly.\nyusheng kuo: We can easily audit that.\nyusheng kuo: Not just some fake result but using all the intermediate thing.\nyusheng kuo: So we also use another trick that's a third trick.\nyusheng kuo: So the first trick is using the link file for all the step they need to take so it doesn't over cram the cloud.\nyusheng kuo: Your agent IMD file.\nyusheng kuo: And then the second thing is the task list.\nyusheng kuo: Right.\nyusheng kuo: So it auto build the pipeline reliably.\nyusheng kuo: The third thing is actually we use this hook to validate the schema output so we know if they're missing anything they will be able to be raised here.\nyusheng kuo: Again A will be raised here.\nAndriy Vovchak: Oh huh.\nAndriy Vovchak: And doesn't move any further.\nyusheng kuo: Yeah, it will raise here and then the agent will actually read the agent output say oh I am missing something.\nyusheng kuo: And they will go back to fill that blank.\nyusheng kuo: You don't need to worry about it.\nyusheng kuo: It was just like let's take this like a pipeline itself if it ever miss something.\nyusheng kuo: Yeah.\nyusheng kuo: So eventually I can show you what the output look like.\nAndriy Vovchak: That will be great to see.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: So this is actually the output.\nyusheng kuo: So you can actually send this back to clay.\nyusheng kuo: Right.\nyusheng kuo: And then this would just become first a row like color in the clay.\nyusheng kuo: And then you can kind of expand this to anything.\nyusheng kuo: Right.\nyusheng kuo: So you can see there's the company data.\nyusheng kuo: You would say okay, I use this tool to get the company data.\nyusheng kuo: And then here's the source of the data.\nyusheng kuo: And who is it?\nyusheng kuo: It's called Felix.\nyusheng kuo: What's their company facts?\nyusheng kuo: And then here's a ler search.\nyusheng kuo: Right.\nyusheng kuo: He Used parallel web search and here's the source of the search and then the data is actually Dory stats Shrinder who's a senior five spreader people in operation.\nyusheng kuo: So you can easily audit the result coming in.\nyusheng kuo: Right.\nyusheng kuo: Because for this step actually there's a verification step is like after the leader searching they will run the linking search to validate that to make sure that it's still latest.\nyusheng kuo: Not using some.\nyusheng kuo: But parallel is pretty good I would say.\nyusheng kuo: Yeah, much better.\nAndriy Vovchak: Much, much better.\nAndriy Vovchak: Because I'm trying to get.\nAndriy Vovchak: Get my hand around like all this.\nAndriy Vovchak: All this.\nAndriy Vovchak: Like there is parallel, there's exa.\nAndriy Vovchak: Then there is also.\nAndriy Vovchak: Well Tabili has some solutions for that.\nAndriy Vovchak: I don't know.\nAndriy Vovchak: But yeah, if parallel you think that is better than.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: Interesting.\nyusheng kuo: Well yeah, yeah for me that's one of the best.\nyusheng kuo: Yeah.\nyusheng kuo: And then he will come in to like contact profile.\nyusheng kuo: I I didn't go for like email finding like contact finding finding because I don't have those kind of MCP in my, my repository and I don't have an API for that.\nyusheng kuo: But I, I have linking person data linking person post.\nyusheng kuo: So you actually pull the post directly try to see any kind of signal there and then you will say hey, the, this post is about HR transformation, people chain investment.\nyusheng kuo: And it would try to go for the job posting.\nyusheng kuo: Right.\nyusheng kuo: Again, the tool and what kind of query you actually ran.\nyusheng kuo: Okay, the input you actually ran and then what's the source, what's the data output?\nyusheng kuo: So you can see like everything and then like what tool I used, what's the result, what's the company, what's the reasoning step everything.\nyusheng kuo: You just like you can easily like earn this whole 12 step pipeline.\nyusheng kuo: I don't know how many column you actually need to build in clay.\nyusheng kuo: I built it like in 10 minutes because I just need to strategize what I want to do and then ask it to find out what tool actually available to do the thing and ask it to do it and then if it run into any step the issue I would just say hey, stop here.\nyusheng kuo: You should do it the other way.\nyusheng kuo: It's like so fast to develop.\nyusheng kuo: But the final result is very structured so I can get very easy to audit anything.\nyusheng kuo: Okay, but idea is like yeah, yeah, yeah.\nAndriy Vovchak: But, but the thing is that when you were creating like this tool if you, if you can show it again to me like this, this for, for the company.\nAndriy Vovchak: Hey hey.\nAndriy Vovchak: Something.\nyusheng kuo: Hey health take care.\nAndriy Vovchak: Yeah yeah.\nAndriy Vovchak: For example, if.\nAndriy Vovchak: Okay, can you reopen the screen so we can look at this like because you have like a bunch of steps in there.\nAndriy Vovchak: And they wanted really to know like when it comes to like when, when it comes to building all of them, like how.\nAndriy Vovchak: How do you go and like specifically go and build these ones?\nAndriy Vovchak: Because it seems that there is lots of work like in terms of agents and death and steps.\nAndriy Vovchak: Do you really have something predetermined?\nAndriy Vovchak: Do you have like some prompts or conditions that you go run?\nyusheng kuo: So, so it's for this one because I'm.\nyusheng kuo: I'm also trying to see okay, how.\nyusheng kuo: What's the best way to do it.\nyusheng kuo: So this one is a bit of a hawk.\nyusheng kuo: So I'm kind of building along the way I know some kind of idea I need to approve create.\nyusheng kuo: So the first thing, actually I always try to create a plan.\nyusheng kuo: Like I would just ask it say okay, I have a plan.\nyusheng kuo: This is the company.\nyusheng kuo: What will be the good thing that we should gather for this company?\nyusheng kuo: I want the programmatic way that I should gather that.\nyusheng kuo: And okay, I would say, okay, knowing this, can you tell me what's the.\nyusheng kuo: The right way to gather them one by one and then they are quite relaxed and here's the kind of the plan outcome that he come up with.\nyusheng kuo: You say, okay, so you, you always start by like primo and ask a question like asking possible angle like the brainstorming strategizing one, right?\nyusheng kuo: And I always say, you know, like whenever.\nyusheng kuo: Nowadays, like whenever you create the cloud code in plan more, they actually create a plan markdown, right?\nyusheng kuo: Yeah.\nyusheng kuo: And then you create a plan markdown and say that and it's doing this and like oh, I will do this signal.\nyusheng kuo: And like who should I target to the sandwich, whatever.\nyusheng kuo: And I would just say okay, like here's a tool available and you can continue to add like more tool here, right?\nyusheng kuo: And like the amplify actor if needed and how to use them.\nyusheng kuo: And like recommend top set.\nyusheng kuo: These are all generated by.\nyusheng kuo: I just saved the file out and I would say okay, what would be the clay web look like with the income?\nyusheng kuo: What should be like external output.\nyusheng kuo: And along the line I change how I want the things to look like.\nyusheng kuo: I say okay, in terms of the schema output.\nyusheng kuo: I don't want to just have the like originally he tried to say just give you.\nyusheng kuo: Wait, what is it?\nyusheng kuo: Yeah, originally he only give me like.\nyusheng kuo: Like he only want to return the final result, right?\nyusheng kuo: If it's a good fit or it's a company data, what's the signal found?\nyusheng kuo: I do that research.\nyusheng kuo: It's good.\nyusheng kuo: But I, I cannot audit that if I, if I. I'm going to audit everything.\nyusheng kuo: Right.\nyusheng kuo: So I just ask it to give it more like through the way.\nyusheng kuo: But the whole intern, he would try to come up with follow things and implementations that like signal detection, whatever.\nyusheng kuo: So be.\nyusheng kuo: Be mindful of like building up your plan is pretty useful.\nyusheng kuo: Yeah.\nyusheng kuo: Because the better your plan, the.\nyusheng kuo: And then you can actually have your call MD showing how you want to do the plan or campaign creation.\nyusheng kuo: So you kind of follow the same principle again.\nyusheng kuo: And once I do it, I actually ask it to clear up and ask it to execute.\nyusheng kuo: And then I will say, okay, this is good.\nyusheng kuo: Like I like this.\nyusheng kuo: Actually summarize what you've done.\nyusheng kuo: Okay.\nyusheng kuo: Including things I don't like it.\nyusheng kuo: Including the things I wanted.\nyusheng kuo: So you will be able to create this step by step.\nyusheng kuo: Just give me one, one more second.\nyusheng kuo: Don't go.\nyusheng kuo: So it's Saturday morning.\nyusheng kuo: Yeah, that's how I. Yeah, that's how I created.\nyusheng kuo: And I think this is like nice to live in your cloud code, but it can hardly be used like you can.\nyusheng kuo: That's where I, I think it's like the next step is like if you can just deploy, for example, we just like.\nyusheng kuo: Can you see my screen still or not?\nAndriy Vovchak: No, not anymore.\nAndriy Vovchak: Not anymore.\nAndriy Vovchak: If you can.\nyusheng kuo: Oh, okay.\nyusheng kuo: Yeah.\nyusheng kuo: Wait.\nyusheng kuo: Yeah.\nyusheng kuo: So like, like after we have this agent.\nyusheng kuo: So I just create this agent.\nyusheng kuo: I say okay, create this agent for me.\nyusheng kuo: So you can see this agent being created here.\nAndriy Vovchak: Yeah.\nyusheng kuo: Oh, that is like up to date.\nyusheng kuo: And yeah, you can see the.\nyusheng kuo: The hook.\nyusheng kuo: Wait, why is this like a format issue or what?\nyusheng kuo: Oh yeah, it's not up today.\nyusheng kuo: I need to pull the data.\nyusheng kuo: But basically this agent file is just the same as this agent IMD file.\nyusheng kuo: And then I would just like go ahead and go to the agent page and select like GTM os right.\nyusheng kuo: And I can just like for example here I'll deploy that first.\nyusheng kuo: So I just connect to my repository and I can just like go to gtmos and then like I have the.\nyusheng kuo: Here you have the full context of my, my agent.\nyusheng kuo: It's like okay, as a prospect research agent, this is the overall plan.\nyusheng kuo: I look at this plan like a high level plan.\nyusheng kuo: This is input is the output.\nyusheng kuo: Here's a reference output that you know what the example look like.\nyusheng kuo: And then the pipeline in JSON file.\nyusheng kuo: Right.\nyusheng kuo: So they can read and how to parallelize it, how to like create a stack task, early exit handling like early exit condition file saving convention, final output parameters for email generation.\nyusheng kuo: So in the end I have and choose not to use because sometimes they try to use some tools that I don't want them to use.\nyusheng kuo: So it's like bad quality of data.\nyusheng kuo: So.\nyusheng kuo: Yeah.\nyusheng kuo: And then I use like a sonnet to do it.\nyusheng kuo: And then here's the entry prompt.\nyusheng kuo: So every time like a Clay coming with the payload that would just be sent to.\nyusheng kuo: So I just hit deploy.\nyusheng kuo: Right.\nyusheng kuo: So Clay would just send to this webhook through the HTTP post and then this will be the.\nyusheng kuo: The agent's like incoming data and then they were just using it and then output the final result of the thing that we just show the one here.\nyusheng kuo: So you will get back this bunch of the payload back.\nyusheng kuo: So you no longer.\nyusheng kuo: First you can start to develop a lot of campaign locally like in your cloud code, but then they can be deployed to your client.\nyusheng kuo: So that's why I feel like it's a good combination.\nyusheng kuo: That's like one of the use case I'm saying because Qualco is so good at implementation.\nyusheng kuo: Right.\nyusheng kuo: Like writing out this plan and then also reading all the context to get the final result.\nyusheng kuo: Like the final message.\nyusheng kuo: Like Clay will be like paying neck to do it.\nyusheng kuo: But Clay is really good at running things at scale.\nyusheng kuo: Yeah.\nyusheng kuo: So that's the angle I'm trying to see.\nyusheng kuo: And so people can just quickly develop all things in cloud code for different client and then.\nyusheng kuo: And then deploy that.\nyusheng kuo: Yeah.\nyusheng kuo: Okay.\nAndriy Vovchak: I'm gonna, I'm gonna.\nAndriy Vovchak: I. I need to.\nAndriy Vovchak: I need to tell you that it's like for example when I tried to.\nAndriy Vovchak: We had this use case for this client for the Swiss company where basically really need to clean the database.\nAndriy Vovchak: I need to clean all the.\nAndriy Vovchak: The input.\nAndriy Vovchak: So what I said like hey listen, I'm gonna do it on cloud code and I've done it inside.\nAndriy Vovchak: I call entire.\nAndriy Vovchak: Entire tickle cloud code with agents and they've built them that there.\nAndriy Vovchak: And yeah, I. I often had to in that case.\nAndriy Vovchak: No, I haven't used any like of the MCPS from.\nAndriy Vovchak: From that agenda.\nAndriy Vovchak: I don't think I I called anything from there.\nAndriy Vovchak: But anyway like I had to put like mostly.\nyusheng kuo: Yeah yeah.\nAndriy Vovchak: Travel in there.\nAndriy Vovchak: But the thing is that they.\nAndriy Vovchak: And then I had to do the same exact thing.\nAndriy Vovchak: So I had an output because we run.\nAndriy Vovchak: We ran like a proof of concept which makes sense for the clients, you know.\nAndriy Vovchak: And then when you go and deploy it on Clay because they're gonna use it right.\nAndriy Vovchak: So when you go and deploy on Clay it becomes like huge thing.\nAndriy Vovchak: It compose immense thing to.\nAndriy Vovchak: To go and replicate it and the result is still like okay, like you spent a lot of Tokens and the credits.\nAndriy Vovchak: Anyways, so the problematic thing becomes when they actually need something.\nAndriy Vovchak: You know, like when they actually need something on clay.\nAndriy Vovchak: And therefore your solution for that is just like hey, use the agent.\nAndriy Vovchak: Like put it all together into an agents that you go and deploy the.\nAndriy Vovchak: My.\nAndriy Vovchak: My question would be then once this is done, let's say that I can put it all together there.\nAndriy Vovchak: I need to really be careful with.\nAndriy Vovchak: With the outputs because all those output.\nAndriy Vovchak: Because all the outputs of the agents that are JSON, they become like a column right.\nAndriy Vovchak: On clay.\nAndriy Vovchak: Because it becomes like what they see.\nAndriy Vovchak: Right.\nAndriy Vovchak: An output like company.\nAndriy Vovchak: Company HQ is in Zurich.\nAndriy Vovchak: Okay.\nAndriy Vovchak: So to say so there my think is.\nAndriy Vovchak: My thinking is you need to be really careful mapping that.\nAndriy Vovchak: But also you need.\nAndriy Vovchak: If there are changes to be made, I said that I'm not that happy.\nAndriy Vovchak: If there are changes to be made once I deploy it, then I need to do my changes on my cloud code and then I have to repush it on the repo and then it's going to be on that agenda.\nAndriy Vovchak: It's gonna be called by Clay.\nAndriy Vovchak: So that's.\nAndriy Vovchak: That's the only thing that becomes.\nyusheng kuo: Yeah, yeah, yeah, I agree.\nyusheng kuo: Yeah.\nyusheng kuo: It's not the.\nyusheng kuo: The easy thing to like fine tune.\nyusheng kuo: Like it's just a small detail, right?\nyusheng kuo: You want to just tune it in in clay?\nAndriy Vovchak: Yeah, yeah, yeah.\nAndriy Vovchak: Like yeah, on Clay you can just open the prompt anyway.\nAndriy Vovchak: Like it's not that easy.\nAndriy Vovchak: But because trust me, making changes after.\nAndriy Vovchak: If.\nAndriy Vovchak: If you have like three or four or five re.\nAndriy Vovchak: Enrichments of basically columns that you have on clay and then you need to Change the column, 2 and 3 and 4 and 5 are affected.\nAndriy Vovchak: It's crazy man.\nAndriy Vovchak: I'm telling you that is gonna.\nAndriy Vovchak: It's suicide.\nAndriy Vovchak: And if you have like complex enrichments that really becomes like really complicated.\nAndriy Vovchak: So I think that in a way or in another, like there are pros and cons in.\nAndriy Vovchak: In both.\nAndriy Vovchak: Both of this.\nyusheng kuo: But yeah, yeah, yeah.\nyusheng kuo: So I think like that, that yeah.\nyusheng kuo: Just this is one of my use case of like cloud code with clay.\nyusheng kuo: And yeah, I'm also like you mentioned something like this kind of recursive thing of the agency, right?\nAndriy Vovchak: Yeah.\nAndriy Vovchak: Because okay, there is this big thing that I want to store.\nAndriy Vovchak: This is the, the big thing that I.\nAndriy Vovchak: Where I see clay lagging behind is that I want to store all the inputs and outputs of my agent.\nAndriy Vovchak: Like let's say that on Clay you have a prompt.\nAndriy Vovchak: You have a prompt, right?\nAndriy Vovchak: You run it, they call it agent, but at the end it's a prompt.\nAndriy Vovchak: It becomes like, in a way, it becomes even a skill.\nAndriy Vovchak: It can become a skill, like right on infrastructure.\nAndriy Vovchak: But the thing is that I, then I, I want to store this input and outputs.\nAndriy Vovchak: Like I want to say like this agent is connected, it has an ID and it's connected to these inputs and to this output.\nyusheng kuo: Yeah.\nAndriy Vovchak: Why, why do you want.\nAndriy Vovchak: Why do you.\nAndriy Vovchak: Would you even bother to do such a thing?\nAndriy Vovchak: First of all, for reusability, people don't use the templates on clay.\nAndriy Vovchak: I'm telling you, no one is using templates.\nAndriy Vovchak: No one is grouping tools, things on clay.\nAndriy Vovchak: Yeah, trust me, trust me that I'm seeing it with experienced people.\nAndriy Vovchak: So this is first for reusability and second is because I want to then be able to audit the input outputs and also I want and also like to.\nAndriy Vovchak: To go and share to my.\nAndriy Vovchak: To like we've been running this, we can reuse it for another company, another project.\nAndriy Vovchak: Yeah, so, yeah.\nyusheng kuo: So you're saying like the.\nyusheng kuo: Because Cloud, like ClayJ couldn't save all the history record.\nAndriy Vovchak: Indeed.\nyusheng kuo: I see.\nyusheng kuo: So you want to have like a.\nyusheng kuo: So what do you think will be the solution for this?\nAndriy Vovchak: I'm thinking that indeed, like include code.\nAndriy Vovchak: You have that solution?\nyusheng kuo: Actually.\nyusheng kuo: Yeah.\nyusheng kuo: Can you help me to see that?\nyusheng kuo: I don't understand.\nyusheng kuo: That's like very well.\nyusheng kuo: Like how, what, what, what?\nyusheng kuo: Yeah, don't worry about like my solution.\nyusheng kuo: What, what do you think that this thing should be done in your mind?\nAndriy Vovchak: I. I think that indeed what I want to see.\nAndriy Vovchak: Let me really like my screen.\nAndriy Vovchak: I can, I can.\nAndriy Vovchak: Yeah, like explain it because it's.\nAndriy Vovchak: Let me like, if we, if we are for example, on, on Clay.\nAndriy Vovchak: Clay runs like this, right.\nAndriy Vovchak: Let's say that this is the clay environment.\nAndriy Vovchak: And what, what we do here is that we have client one, right.\nAndriy Vovchak: And he needs a specific enrichment.\nAndriy Vovchak: I say that he needs to study like a study series, like a series of LinkedIn posts.\nAndriy Vovchak: Right?\nyusheng kuo: Yeah.\nAndriy Vovchak: The thing is that once you, once you've done that once, so what do you do?\nAndriy Vovchak: You have a prompt that does this on clay.\nAndriy Vovchak: You deploy it, you're happy with it, sayonara, you move forward.\nAndriy Vovchak: The thing is that then this is lost to client one.\nAndriy Vovchak: This is just becomes like lost to client one.\nAndriy Vovchak: You can't do anything, anything about it.\nAndriy Vovchak: So basically like this is going to stay like to client one.\nAndriy Vovchak: Then you have another client ask you for more or less the same thing.\nAndriy Vovchak: Study again.\nAndriy Vovchak: Like this is gonna be.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: Client two, like show, show me how you can do this.\nAndriy Vovchak: And you say, yeah, we totally can do it.\nAndriy Vovchak: We can have a solution.\nAndriy Vovchak: But this at the end is like a small SaaS that you built because you have like a series.\nAndriy Vovchak: This, this is the key.\nAndriy Vovchak: The key part is the input examples and outputs.\nAndriy Vovchak: Again like also here is you must have some examples.\nAndriy Vovchak: Then you want to reuse it.\nAndriy Vovchak: And this happens like all the time.\nAndriy Vovchak: You want to reuse it, but then what you need to do, you need to go copy it.\nAndriy Vovchak: Copy, paste it here.\nAndriy Vovchak: Check if it's like actually like worth if it's matches the inputs.\nAndriy Vovchak: Because you know like inputs and outputs like are a bit strict on clay.\nAndriy Vovchak: You know you, you need to have them included or excluded.\nAndriy Vovchak: It's a bit complicated.\nyusheng kuo: Yeah, yeah, yeah.\nAndriy Vovchak: What, what you want.\nAndriy Vovchak: What I want have one agent that is more.\nAndriy Vovchak: That is more.\nAndriy Vovchak: It's not, it's not that deterministic and strict.\nAndriy Vovchak: What do I mean by that is that it doesn't require.\nAndriy Vovchak: It doesn't ask me to have like specific type of input like it has.\nyusheng kuo: Yeah.\nAndriy Vovchak: Show me.\nAndriy Vovchak: Maybe a person's.\nAndriy Vovchak: So this, this person LinkedIn URL.\nAndriy Vovchak: And then it understands that the step two is to extract the LinkedIn, extract the LinkedIn, extract the link posts.\nAndriy Vovchak: And then the step three is extract the content of this.\nyusheng kuo: So I see.\nAndriy Vovchak: So this, this becomes like in a way like smarter.\nAndriy Vovchak: It's not that deterministic because otherwise you in clay the big thing, how easy clay is that you keep playing with the same Lego pieces and rebuilding like every single time.\nAndriy Vovchak: With code on the other hand, it's less deterministic.\nAndriy Vovchak: So it says that do I have the personal LinkedIn URL?\nAndriy Vovchak: No, I don't care because I already have all the LinkedIn post.\nAndriy Vovchak: Great, I'm gonna go and extract the content.\nAndriy Vovchak: So I go to step two.\nyusheng kuo: Yeah.\nAndriy Vovchak: Without like wasting any credits on this level.\nAndriy Vovchak: So anyway this is.\nyusheng kuo: So you're thinking like for example like an agent that's just deployed and then you just like once you deploy you can just be very freely describe what you want because you know all the contacts being kind of like a prompt template already built in.\nyusheng kuo: You just use the agent.\nAndriy Vovchak: Yes.\nAndriy Vovchak: And it's.\nAndriy Vovchak: Why does this like why the.\nAndriy Vovchak: It just becomes important.\nAndriy Vovchak: For example, we, this company now needs to use this sales playbook.\nAndriy Vovchak: We need.\nAndriy Vovchak: We have a customer where we basically need to extract the.\nAndriy Vovchak: Like study the.\nAndriy Vovchak: Study the tech stack company.\nAndriy Vovchak: But we have already an agent that does this.\nAndriy Vovchak: Like we have like more or less like exactly.\nAndriy Vovchak: We need the same exact agent.\nAndriy Vovchak: What we need to change is that tech stack we.\nAndriy Vovchak: We look for.\nAndriy Vovchak: Because of course like for one client we look for, I don't know, Salesforce for another client.\nAndriy Vovchak: We look for Atio.\nAndriy Vovchak: Okay, so the.\nAndriy Vovchak: It's.\nAndriy Vovchak: But it's the same exact thing.\nAndriy Vovchak: It's the same exact thing.\nAndriy Vovchak: But now I need to reuse it.\nAndriy Vovchak: And then what we want to do is that we want to also build copy.\nAndriy Vovchak: Yeah, build copy from this info.\nAndriy Vovchak: And this is what you want.\nAndriy Vovchak: You want to get really fast here.\nAndriy Vovchak: But now that you need to extract the text tag, you need to go and build the prompt that actually like understands.\nAndriy Vovchak: Like do we qualify or disqualify this component company?\nAndriy Vovchak: We are looking for Salesforce.\nAndriy Vovchak: We found a HubSpot.\nAndriy Vovchak: Okay, disqualified stock.\nAndriy Vovchak: And you need this.\nAndriy Vovchak: You need this memory of agents and of inputs and outputs because then it's really easy to have an army of agents.\nAndriy Vovchak: Like let's say like you're gonna have like Agent Agent 1, Engine 2, Engine 3 and.\nAndriy Vovchak: And you can just deploy them for every single customer.\nAndriy Vovchak: It's basically like having.\nAndriy Vovchak: By the way, I don't know if you.\nyusheng kuo: If you know.\nAndriy Vovchak: But play is trying.\nAndriy Vovchak: They.\nAndriy Vovchak: They wanted to achieve something similar.\nAndriy Vovchak: By doing the functions.\nAndriy Vovchak: Do you know about the functions?\nyusheng kuo: No, I. I don't.\nAndriy Vovchak: Yeah, let me.\nAndriy Vovchak: Or maybe I have it on another.\nAndriy Vovchak: I gotta tell you, this is not like a big secret or something.\nAndriy Vovchak: But it's just like the.\nAndriy Vovchak: I'm.\nAndriy Vovchak: I don't know if it's like still.\nAndriy Vovchak: Yeah, here you go.\nAndriy Vovchak: Functions.\nAndriy Vovchak: So basically what.\nAndriy Vovchak: What is a function is a series of inputs and outputs.\nAndriy Vovchak: Your function itself is not being infer configured here configuring it book here.\nAndriy Vovchak: So basically you see that here I'm prefer.\nAndriy Vovchak: I'm basically I'm building an agent on clay.\nAndriy Vovchak: So I'm specifying what is the input that I want.\nAndriy Vovchak: Let's say that I want the company URL.\nAndriy Vovchak: Okay.\nAndriy Vovchak: So I'm gonna build it this way.\nAndriy Vovchak: But again like this is going to be like a.\nAndriy Vovchak: A huge series of.\nAndriy Vovchak: If this then that build on clay.\nyusheng kuo: Yeah.\nyusheng kuo: Yeah.\nAndriy Vovchak: And once this is ready, I can deploy it as a new function.\nAndriy Vovchak: Because here I'm gonna put like.\nAndriy Vovchak: Okay, if the company rail.\nAndriy Vovchak: Then analyze the text.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Once.\nAndriy Vovchak: Okay, if I have this exec, then do this.\nAndriy Vovchak: If I have that tech sec, then do something else.\nyusheng kuo: Yeah.\nAndriy Vovchak: And they are trying to do it.\nAndriy Vovchak: It's been like live since I think June for.\nAndriy Vovchak: For some people, like for myself.\nAndriy Vovchak: But this is like my private workspace where I do have anything.\nyusheng kuo: But.\nAndriy Vovchak: Yeah, this is something that they're heavily looking into.\nAndriy Vovchak: And in a way you.\nAndriy Vovchak: You're solving it already.\nAndriy Vovchak: You're substituting substituting all this mess with the, with the, with the agents that you wanted to build.\nAndriy Vovchak: So I don't know like if this gives you any input.\nAndriy Vovchak: I hope so.\nAndriy Vovchak: Yeah, let me know.\nyusheng kuo: Yeah, yeah, yeah.\nyusheng kuo: It's just like I think yeah, this definitely give me ideas like what's like the potential use case.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: I think that's like.\nyusheng kuo: So in terms of the function you basically can just review including like agent everything like a input output.\nyusheng kuo: Right?\nyusheng kuo: Yeah.\nyusheng kuo: Actually I have like a side topic for you.\nyusheng kuo: So do you think in terms of this like agency like especially like outbound engineering.\nyusheng kuo: What's like the constraint that to scale you for more clients because the pipeline or because of the capability?\nAndriy Vovchak: No, they basically took me.\nAndriy Vovchak: They.\nAndriy Vovchak: They are really honest people by the way.\nAndriy Vovchak: They are really like Swiss people, you know, like straight to the point and.\nyusheng kuo: Yeah.\nAndriy Vovchak: And up front.\nAndriy Vovchak: And so they told me, listen, we can hire other 3 or 4 TTM engineers or even HubSpot experts and what we can do is just get more clients and get more revenue.\nAndriy Vovchak: But it's not going to be in a structured way.\nAndriy Vovchak: It's not going to be in a way like it's going to create chaos because we don't have processes.\nAndriy Vovchak: We, we like they have processes.\nAndriy Vovchak: They have processes on onboarding how to work with guys.\nAndriy Vovchak: They have that.\nAndriy Vovchak: But we don't know if this is gonna.\nAndriy Vovchak: If.\nAndriy Vovchak: If the input that we get like okay, we get other two like GTM engineers and one HubSpot expert and then we get 15 clients because they can serve them like five each let's say.\nyusheng kuo: And how long they would stay indeed.\nAndriy Vovchak: Like how long they will say how our processes are replicable across this.\nAndriy Vovchak: And this has become, this is becomes like the usual thing that everyone says that the agent and agency is not scalable.\nAndriy Vovchak: And it did.\nAndriy Vovchak: It's true.\nyusheng kuo: Yeah, yeah.\nAndriy Vovchak: But with processes like clay or even we process I even not with clay that much but maybe with processes like building agents like you.\nAndriy Vovchak: You shank you enabling us to build agents that we can just basically we for example, we.\nAndriy Vovchak: We know how to import the client.\nAndriy Vovchak: We know what to ask to Diamonds1.\nAndriy Vovchak: We know we have even some prompts to do that.\nAndriy Vovchak: Now we really need to have a structured way to deploy that somewhere code like on my laptop so to say.\nAndriy Vovchak: Right.\nyusheng kuo: Yeah, yeah.\nAndriy Vovchak: And the.\nAndriy Vovchak: So I.\nAndriy Vovchak: We need a point of union that is not a Google Doc because by the way agencies, it means that everything is really dispersed.\nAndriy Vovchak: Right.\nAndriy Vovchak: It's something that's on Google Doc or something is on a spreadsheet.\nAndriy Vovchak: Something is on A transcript, video or something.\nAndriy Vovchak: But you don't have it like in one place.\nyusheng kuo: Yeah.\nAndriy Vovchak: So flood code becomes your ally for that.\nAndriy Vovchak: But then you need a structured way.\nAndriy Vovchak: And I think that the best thing that how you for example can help me is for example to help me to build some agents.\nAndriy Vovchak: Like I'm telling you, like I want to use on scale.\nyusheng kuo: Yeah.\nAndriy Vovchak: And I would like to have like from this is my wish so to say.\nAndriy Vovchak: Right.\nAndriy Vovchak: Because I really would like to have an expert in building agents like you to come to me.\nAndriy Vovchak: Okay, here is how you build them.\nAndriy Vovchak: And now you can deploy them across five.\nAndriy Vovchak: Five clients.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: This is also something I'm seeing.\nyusheng kuo: So this is another angle.\nyusheng kuo: Yes.\nyusheng kuo: Helping clay to be more efficient could be interesting.\nyusheng kuo: But I also thinking people were gradually migrating out of clay to some point.\nyusheng kuo: At some point.\nyusheng kuo: Because in the end it's like an API orchestrator, but it's through the heavy ui.\nyusheng kuo: Just like I can actually do that pipeline easily in cloud code.\nyusheng kuo: People eventually will be able to.\nyusheng kuo: Now probably I know a bit of how to kind of structurally create those agents to be more reliable.\nyusheng kuo: But this will also become quickly people be able to understand it then I just don't see a lot of value, a huge value in clay in the near term future.\nyusheng kuo: So I think the real value is like you say what we are kind of experimenting now is helping the client to build up their own contacts and not just helping your comp, like your agency build agent, but your agency can build agent for your client.\nAndriy Vovchak: Indeed.\nyusheng kuo: Yeah.\nyusheng kuo: And then that become a very fresh offering.\nyusheng kuo: Right.\nyusheng kuo: And then they don't become like a one off thing.\nyusheng kuo: Right.\nyusheng kuo: Because like this whole, whole outbound is not just like a one time outbound.\nyusheng kuo: It's like you kind of intertwine into the operation day to day.\nyusheng kuo: Yeah.\nyusheng kuo: So that's where I see this like could be like a huge value.\nyusheng kuo: So I think we, what we can do is we can just start to build some agent together in Cloudflare.\nyusheng kuo: Like you say like, like in your execution side.\nyusheng kuo: Right.\nyusheng kuo: You say you have like a meeting.\nyusheng kuo: Right.\nyusheng kuo: Or like on board.\nyusheng kuo: I remember.\nyusheng kuo: Can you show me the Miro again?\nyusheng kuo: Your mirror?\nAndriy Vovchak: Oh, oh yeah, yeah.\nyusheng kuo: Let me.\nAndriy Vovchak: Because I'm.\nAndriy Vovchak: I'm also.\nAndriy Vovchak: I'm a bit.\nyusheng kuo: Yeah.\nAndriy Vovchak: What was it?\nyusheng kuo: Okay.\nyusheng kuo: Sorry.\nAndriy Vovchak: Yeah, here you go.\nAndriy Vovchak: Like in this one.\nyusheng kuo: Actually we can start by reading skill.\nyusheng kuo: Yeah.\nyusheng kuo: Like.\nAndriy Vovchak: Yeah.\nyusheng kuo: Basically training skill into like small agent and bit deploy.\nyusheng kuo: So like prep for the demo.\nyusheng kuo: It would be like an agent that constantly look up for the demo and then go into the demo and then Try to pull the demo and prep the demo for you before you ask it to prep the demo.\nyusheng kuo: That's a very simple thing to do.\nyusheng kuo: For example, a meeting before me, you actually want to get an email about me and how it's going to be.\nyusheng kuo: So this will be an agent that's useful for your client because if they have like funny meeting then having an agent that's actually constantly like helping them will be very useful.\nAndriy Vovchak: Yeah, you mean like to deploy it somewhere in here?\nAndriy Vovchak: Let's say.\nyusheng kuo: Yeah, so you can like a pull for the calendar.\nyusheng kuo: Right.\nyusheng kuo: Or anything.\nyusheng kuo: And then like prep that.\nyusheng kuo: Just start from something simple.\nyusheng kuo: That's what I would say.\nyusheng kuo: And try to deploy that and see how it goes.\nyusheng kuo: Actually every day I have this meeting summarizer.\nyusheng kuo: After I finish this summarize with you, my agent, my Coco agent will actually grab the data from because Firefly will send a webhook to me and then I will use the webhook to pull the transcript and then summarize within Cloudcock.\nyusheng kuo: So it's like really relevant to me.\nyusheng kuo: Not like some generic like Firefly summary.\nyusheng kuo: And I can like a grouping that in whatever way I want.\nyusheng kuo: Like I have one Like I say okay, if this is meeting with our team, then this is an internal meeting.\nyusheng kuo: Internal meeting.\nyusheng kuo: I need to extract in a to do and if it's someone like outside of us, it will be a prospect meeting.\nyusheng kuo: Then you should extract their pain point.\nyusheng kuo: So we would be able to.\nAndriy Vovchak: And I'm telling you also this, that this becomes like data that you get from somewhere and you store it.\nAndriy Vovchak: And you store it because.\nyusheng kuo: Yeah, exactly.\nyusheng kuo: You store it into my contacts repo.\nAndriy Vovchak: And you have context indeed.\nAndriy Vovchak: Yes, yes, yes.\nyusheng kuo: So when I come in I already can just say hey, based on my last three prospect what did I do right?\nyusheng kuo: What did I do wrong?\nyusheng kuo: And then the cow co can just directly answer me.\nyusheng kuo: I don't need to report like recurring like orchestra repo.\nyusheng kuo: The repo is just kind of aligned by itself.\nyusheng kuo: Yeah.\nyusheng kuo: And then we are also thinking like helping to deploy this kind of multi channel point because it's always very hard to know.\nyusheng kuo: Okay, I send out this hey rich sequencing, right.\nyusheng kuo: Like A then B, then C. But like also sending out the email.\nyusheng kuo: Right.\nyusheng kuo: But what if it responding email?\nyusheng kuo: My rich sequence doesn't know you already respond it continue to request something.\nyusheng kuo: Right?\nyusheng kuo: Yeah, but this can actually be easily solved by having this one action MD Every time you send an email or someone replied the email, it will fly the webhook to call this agent and this agent will update your Action MD to say okay, this guy actually responded instead of having a very rigid like sequencing automation.\nyusheng kuo: Actually your agent will just look at this.\nyusheng kuo: You.\nyusheng kuo: You actually describe your sequencing preference in your agent IMD and they will look at your what happened actually.\nyusheng kuo: Right?\nyusheng kuo: Because you have this like central log like time step central log of what you have done.\nyusheng kuo: Like oh, I actually meet with that.\nyusheng kuo: So I don't need this email like to send out anymore because he already meet with me right through the LinkedIn request.\nyusheng kuo: And then so the agent would know it would not send out the email.\nyusheng kuo: It would be so hard to manage like in nowadays this kind of multi channel like the sequencing machine.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: Okay.\nAndriy Vovchak: I'm telling you like the reason I'm running also into a problem right now that is like first of all you just managed to brilliantly explain by the way a problem that is this multi sequencing.\nAndriy Vovchak: And but there is also another problem because for example we have built a list for a client, let's say list one that has I don't know like.\nAndriy Vovchak: Let's say that it has like some SaaS in UAE, right?\nAndriy Vovchak: We build this.\nAndriy Vovchak: But this SaaS means everything and nothing, right?\nAndriy Vovchak: Let's say that we have another list where the same clients.\nAndriy Vovchak: The same client.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: Okay, but these are like fintechs.\nAndriy Vovchak: Now if we.\nAndriy Vovchak: These can be related.\nAndriy Vovchak: Let's say that here there are like then comp.\nAndriy Vovchak: Like let's say that there is like 1.2% overlap now.\nAndriy Vovchak: Yes, this is a problem.\nAndriy Vovchak: This is a huge problem.\nAndriy Vovchak: This is not something that you can want to mess with.\nAndriy Vovchak: And.\nAndriy Vovchak: And I mean also like one big problem that becomes here just you mentioned the multi channel and I want to add like it's not only multi channel which is like already big one but it's also this like in terms of campaigns building.\nAndriy Vovchak: But also.\nAndriy Vovchak: Okay, let's say that there is this overlap, right?\nAndriy Vovchak: Okay, but we have a conversation when.\nAndriy Vovchak: When.\nAndriy Vovchak: When was this person.\nAndriy Vovchak: When was the lead in list one contacted?\nAndriy Vovchak: Because if it is we we need the timestamp because.\nAndriy Vovchak: Because if it was a contacted like four months ago, no reply.\nAndriy Vovchak: Dude, we can call them, we can enroll them in LinkedIn sequence.\nAndriy Vovchak: But we need to know this info otherwise it stays on the sequence here.\nyusheng kuo: Yeah, yeah, yeah.\nyusheng kuo: That's like the real strength of cloud code is like you can aggregate all and then like it doesn't like mechanically like logical.\nyusheng kuo: Because now that most of this kind of a sequencing engine like a very rigid logic.\nyusheng kuo: I can do this in three days.\nyusheng kuo: No respond, ask do something right?\nyusheng kuo: Like how code can be like so Flexible like you just like for each client.\nyusheng kuo: What we're doing now is they just look up all the history of action.\nAndriy Vovchak: Exactly.\nyusheng kuo: You don't need to worry where the action is from because agent will auto update the action in the background.\nAndriy Vovchak: But also I'm telling you more, I'm going to tell you a bit more on this that if you smart smart like salesperson I don't consider myself but anyway okay, let's say smart.\nAndriy Vovchak: I, I, I, I'm saying like a small as smart like GTM engineer or a smart person knows that this one we have let's say you Shang.\nyusheng kuo: Yes.\nAndriy Vovchak: Is the CTO and Andre is why why Obsidian keeps like pulling it like everywhere.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Why can't they understand like when I'm hovering like okay and Andre is the GTM Eng.\nAndriy Vovchak: Right.\nAndriy Vovchak: So now let's say that I know that no reply on sequence 1.\nAndriy Vovchak: Now I want that okay.\nAndriy Vovchak: I want to be able, I want.\nyusheng kuo: To.\nAndriy Vovchak: Talk to my database knowing that Andre is also related to this list.\nAndriy Vovchak: Because I extracted Andre but I haven't talked to him because I want the ctos only.\nAndriy Vovchak: But now I want you an intro.\nAndriy Vovchak: This is huge for especially nowadays when it's like maybe we talk to reason people.\nAndriy Vovchak: Why why I'm not doing this.\nAndriy Vovchak: I'm not doing this because I have silent a siloed list and I don't know who is an, an alternative, an alternative person to contact.\nAndriy Vovchak: And so therefore I cannot like run this campaign.\nAndriy Vovchak: I need to go and build another list of GTM engineers or whoever here let's say even hr.\nAndriy Vovchak: Right.\nAndriy Vovchak: But I, I don't know like have I, has, has you shank replied to me or not?\nAndriy Vovchak: What, what did he say?\nAndriy Vovchak: Yeah, is he even like I don't know what happened.\nAndriy Vovchak: Was he like on LinkedIn or an email?\nAndriy Vovchak: So I can send an email to Andre because I talk to my because now cloud code.\nAndriy Vovchak: I'm like this is too critical.\nAndriy Vovchak: This is too critical because this is AGI almost for GTM engineering.\nAndriy Vovchak: Like almost CC knows that CTO hasn't replied but GTM Eng.\nAndriy Vovchak: Is on a list so therefore I can talk to my okay, who, who are some alternative contacts.\nAndriy Vovchak: So it doesn't go and run the research and all the people but it already has the context.\nAndriy Vovchak: It tells you a for company xyz, Google.\nAndriy Vovchak: Yeah and then you build a messaging where a I try to reach out to you Shank like four, four months ago got no reply.\nAndriy Vovchak: Listen, is this value prop still relevant to you?\nAndriy Vovchak: This is a total different sequence.\nyusheng kuo: Yeah.\nyusheng kuo: This is so hard to do it in a programmatic way, like there's so many possibility age cases like you just need a certain level of intelligence to understand this.\nAndriy Vovchak: Because listen, why I deleted this one because there is a huge problem.\nAndriy Vovchak: Huge problem is here.\nyusheng kuo: How do you handle that now?\nyusheng kuo: Yeah.\nAndriy Vovchak: You, you can handle it to some degree.\nAndriy Vovchak: When for example, you.\nAndriy Vovchak: Here's what I typically do.\nAndriy Vovchak: I build the list, I put them on.\nAndriy Vovchak: On.\nyusheng kuo: On play.\nAndriy Vovchak: Then you can.\nAndriy Vovchak: You typically send it to a spreadsheet and you update the spreadsheet with replied or not.\nAndriy Vovchak: So basically like have they replied or not?\nAndriy Vovchak: Right.\nAndriy Vovchak: And if they have a reply, then maybe I can activate contact two or contact three.\nAndriy Vovchak: But now the huge problem is what if I.\nAndriy Vovchak: Use problem is to think that the people think this.\nAndriy Vovchak: If you shank CTO hasn't replied to me, then they are not on the market.\nAndriy Vovchak: Who the hell cares?\nAndriy Vovchak: Who the hell cares?\nAndriy Vovchak: Can I send, Can I send.\nAndriy Vovchak: I. I hope, I hope that your kid didn't hear me saying like who the hell.\nyusheng kuo: No, I'm on headphones.\nAndriy Vovchak: It's on your headphones.\nAndriy Vovchak: Okay, so who then I want to send this to the client.\nAndriy Vovchak: Client has a repo or CSV or SQL.\nAndriy Vovchak: I don't know.\nAndriy Vovchak: Like depends on.\nAndriy Vovchak: For example, we have a pretty skilled client where they have like a head of AI who.\nAndriy Vovchak: Yeah, yeah, he.\nAndriy Vovchak: He really is like.\nAndriy Vovchak: He has big logics in terms of data handling.\nAndriy Vovchak: So they have lots of things here.\nAndriy Vovchak: So basically let's say that we send them a SQL and we tell them, listen, for the months that we've been working together, there are some companies that are still really good for you, but they just didn't engage with us in our campaigns.\nAndriy Vovchak: Nonetheless, please keep them in mind for clients has a repo of context for what?\nAndriy Vovchak: For marketing.\nyusheng kuo: Or.\nAndriy Vovchak: Lead magnets campaigns.\nAndriy Vovchak: And you go with it like whatever you want.\nAndriy Vovchak: Like here, here you put whatever you want.\nAndriy Vovchak: But this doesn't happen.\nAndriy Vovchak: This doesn't happen in agencies.\nAndriy Vovchak: Agencies.\nAndriy Vovchak: They tell you, okay, listen, this didn't reply.\nAndriy Vovchak: Maybe it was a bad target or they even don't tell if they haven't replied.\nAndriy Vovchak: They just tell you, hey, the result of this campaign is three people reply out of 900.\nAndriy Vovchak: Yeah, but there is no such a thing like this.\nAndriy Vovchak: Because if, if it is a qualified account.\nAndriy Vovchak: Let's say that we work for obsidian.com, right?\nyusheng kuo: Yeah.\nAndriy Vovchak: And you're the CTO and I'm the GTM engineer.\nAndriy Vovchak: Well, and you're in target.\nAndriy Vovchak: We need to have this loop.\nAndriy Vovchak: I need to know this and they need to.\nAndriy Vovchak: And they want to be able to query this to know like the data.\nAndriy Vovchak: To know this.\nyusheng kuo: Yeah, this was really long.\nAndriy Vovchak: But just to give you context that this solves a huge problem.\nyusheng kuo: So you have like mentioned like several problems.\nyusheng kuo: Okay.\nyusheng kuo: Is it.\nyusheng kuo: Do you think they are kind of the one problem underneath or they are actually like separate thing that you need to kind of tackle like one by one.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Like there is.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: First problem.\nAndriy Vovchak: Let's start from the, from the simple one to a more.\nAndriy Vovchak: More complex one.\nAndriy Vovchak: The simple one is one late doesn't reply.\nAndriy Vovchak: What do you do then?\nAndriy Vovchak: I need to have a waterfall logic.\nyusheng kuo: Yeah.\nAndriy Vovchak: Also re engagement is a second problem.\nAndriy Vovchak: Okay.\nAndriy Vovchak: This lead hasn't replied on month on in Q1.\nAndriy Vovchak: I would love to prospect them in Q2 again.\nyusheng kuo: Yeah.\nAndriy Vovchak: And then it's.\nAndriy Vovchak: It's not only that, is that.\nAndriy Vovchak: Okay, this lead is highly qualified because this is tier one.\nAndriy Vovchak: But we, we really want to get in because.\nAndriy Vovchak: Okay, companies need to think in terms of account, not in terms of leads.\nAndriy Vovchak: For example, let's say that you shank doesn't reply to emails, doesn't care about LinkedIn.\nAndriy Vovchak: But Andre is, is active on LinkedIn and maybe replies to emails.\nAndriy Vovchak: I don't know.\nAndriy Vovchak: But you need to have logic that if they don't reply that doesn't mean that they are not on the market.\nAndriy Vovchak: And especially if they are like how can I reuse this data?\nAndriy Vovchak: Because I have built the list.\nAndriy Vovchak: Listen, I've done this work.\nAndriy Vovchak: I have built a list, I have created the list.\nAndriy Vovchak: I have attracted the people, I haven't reached them.\nAndriy Vovchak: I have a bunch of information on them and they will give it to the client.\nAndriy Vovchak: So the client like just has access to a clay.\nAndriy Vovchak: Yeah, but they cannot act on it because they have a series of rows and columns.\nAndriy Vovchak: Yeah, but they have marketing budget to retarget you.\nAndriy Vovchak: Yeah, for me.\nyusheng kuo: Yes.\nAndriy Vovchak: So this is, this is a bit of a zoom out and big problem.\nAndriy Vovchak: But the first, the first two that I am experiencing paint like they are a bit more.\nAndriy Vovchak: A bit smaller.\nAndriy Vovchak: And why am I telling you this?\nAndriy Vovchak: Because in cloud code you can do this.\nAndriy Vovchak: Because in cloud code you have the logic of, of all the databases and the information on.\nAndriy Vovchak: We run a campaign from A Yusheng has received an email from the second week of January until like last campaign.\nAndriy Vovchak: Last.\nyusheng kuo: Yeah.\nAndriy Vovchak: LinkedIn message on the third week of LinkedIn.\nAndriy Vovchak: Sorry.\nAndriy Vovchak: Of February.\nAndriy Vovchak: And.\nAndriy Vovchak: And they haven't replied.\nAndriy Vovchak: What do you do?\nAndriy Vovchak: Do I stop?\nAndriy Vovchak: Freeze.\nAndriy Vovchak: You see my point?\nAndriy Vovchak: Like it's, it's a way more complicated problem and now it's solvable.\nyusheng kuo: Yeah.\nyusheng kuo: And then like a Domain expert can kind of come in, describe what they want and the agent will just take action for them.\nyusheng kuo: Like.\nAndriy Vovchak: Indeed, indeed.\nyusheng kuo: Yeah.\nAndriy Vovchak: And then they.\nyusheng kuo: How we want to handle this.\nyusheng kuo: And then agent will just follow.\nyusheng kuo: No code, no code involved.\nAndriy Vovchak: Indeed, indeed.\nAndriy Vovchak: Like, hey, should we go and find.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Like Yusheng hasn't replied.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Can you find me someone else?\nAndriy Vovchak: Like if a reference.\nAndriy Vovchak: Reference.\nAndriy Vovchak: One to run here because this is what many agencies are trying to run as well is that this is what I advise always is to have like one, two or three contacts for account.\nyusheng kuo: Yeah.\nAndriy Vovchak: Why this becomes important?\nAndriy Vovchak: Because let's say that we have a company of 40 people.\nAndriy Vovchak: 40 people, right?\nyusheng kuo: Yeah.\nAndriy Vovchak: And you are so dedicated to a project, building the next float code AGI, gtm like type of thing.\nAndriy Vovchak: But I am more available, so I would love to be prospected.\nAndriy Vovchak: Like they try you because you're the buyer Persona.\nAndriy Vovchak: But they didn't try me to get an intro or to.\nAndriy Vovchak: Or at least like to explain me the product problem.\nAndriy Vovchak: And then they get the reference.\nyusheng kuo: Yeah.\nAndriy Vovchak: This was almost impossible before you had.\nAndriy Vovchak: Before you had just.\nAndriy Vovchak: Let's build the list of CTOs you think is the CTO.\nAndriy Vovchak: Great.\nAndriy Vovchak: Key scene.\nAndriy Vovchak: Andrey is on the same company.\nAndriy Vovchak: It's not the cdo.\nAndriy Vovchak: So he's out.\nAndriy Vovchak: Therefore it doesn't reply.\nAndriy Vovchak: Therefore the company doesn't want to buy from us.\nAndriy Vovchak: That's it.\nyusheng kuo: Yeah.\nyusheng kuo: And then that's the status quo now.\nyusheng kuo: Like this is just content.\nAndriy Vovchak: I'm telling you.\nAndriy Vovchak: This is huge.\nAndriy Vovchak: And I was really surprised when I saw that.\nAndriy Vovchak: Salesforge.\nAndriy Vovchak: I don't want careers.\nAndriy Vovchak: Salesforce.\nyusheng kuo: Okay.\nAndriy Vovchak: Salesforce.\nAndriy Vovchak: Basically this is.\nAndriy Vovchak: Do you know Salesforce?\nyusheng kuo: Yeah, yeah.\nAndriy Vovchak: Okay.\nAndriy Vovchak: They are sequence here.\nAndriy Vovchak: A great one by the way.\nAndriy Vovchak: And they're from Lithuania and.\nyusheng kuo: Yeah, yeah, yeah, yeah.\nAndriy Vovchak: Indeed.\nAndriy Vovchak: And so they actually have one important thing where basically they go and contact people in a sequenced way.\nAndriy Vovchak: Like let's say that I put.\nAndriy Vovchak: Put in a campaign like three people from Obsidian or Datagen.\nAndriy Vovchak: Let's say that we work for.\nAndriy Vovchak: Of.\nAndriy Vovchak: For Tata Chain.\nAndriy Vovchak: And they are prospected in this way.\nAndriy Vovchak: Like first I contact you Shank.\nAndriy Vovchak: And then I contact Andre.\nAndriy Vovchak: And then I contact Jason.\nAndriy Vovchak: This is already.\nAndriy Vovchak: This is really just to put this in your mind.\nAndriy Vovchak: This is really great.\nyusheng kuo: Okay.\nyusheng kuo: It's a huge feature.\nAndriy Vovchak: This is a great feature.\nAndriy Vovchak: But this that I explained to you, it's not the feature.\nAndriy Vovchak: This is completely strategical change of how you engage on account because you have timestamps.\nyusheng kuo: Yeah, yeah, mate.\nAndriy Vovchak: This is huge.\nAndriy Vovchak: You give a client, by the way, if you can share with me the Transcripts of this code.\nAndriy Vovchak: It would be great because I absolutely presume it anyway, like, yeah, yeah, you give a client a way to say, okay, great, let's see if we can do market.\nAndriy Vovchak: We, we've, we've run like 10 campaigns.\nAndriy Vovchak: There are like millions of people or thousands of people in them.\nAndriy Vovchak: Great.\nAndriy Vovchak: Can we do marketing activities?\nAndriy Vovchak: Can we retarget?\nAndriy Vovchak: Can we ask questions?\nAndriy Vovchak: And you indeed can enable this because for example, my, my first instinct is to build the tool like a custom tool where I can go and query this, my results.\nyusheng kuo: You cannot.\nAndriy Vovchak: No, I would love to go and query my results.\nAndriy Vovchak: Like I would love to build within that agent where I can indeed go and query my results.\nyusheng kuo: Yeah, yeah.\nAndriy Vovchak: So anyway, like it was a lot, you know, but just to give you just the perspective of how things are evolving and how people are looking at.\nyusheng kuo: This, let me actually, I really want to do this because I even think we can sell this to people.\nyusheng kuo: This thing just sell the repo as the mvp.\nyusheng kuo: Eventually you might want to abstract away the repo.\nyusheng kuo: But I don't know if you know we have this kind of feature.\nyusheng kuo: I don't know if I've shared with you this.\nyusheng kuo: Let me share my screen.\nyusheng kuo: So like, so for example, like I, I get this daily activity.\nyusheng kuo: Let me know if you can see my screen.\nyusheng kuo: Yes.\nyusheng kuo: Oh yeah, I get this like an email, right?\nyusheng kuo: Like coming in like every day.\nyusheng kuo: Tell me what the daily activity reported.\nyusheng kuo: How many users recently have some active user?\nyusheng kuo: Yeah, it's like the agent doing that.\nyusheng kuo: So I, I deployed a, an agent.\nyusheng kuo: I think it's in this one.\nyusheng kuo: Yeah, I deploy agent doing this daily activity report.\nyusheng kuo: But I, we realized, okay, we don't want to just report stuff here.\nyusheng kuo: Right?\nyusheng kuo: I see the report, but I don't, I don't care.\nyusheng kuo: I want to care like, okay, who, like what?\nyusheng kuo: Are there something else?\nyusheng kuo: Like the other day, Here's a, a quick example.\nyusheng kuo: So yesterday we have this meeting summarizer.\nyusheng kuo: Let me try to get this one.\nyusheng kuo: Yeah, Yeah, yes, I have this LinkedIn summarizer.\nyusheng kuo: Right.\nyusheng kuo: I talked to another client, sorry, this is an internal meeting.\nyusheng kuo: So he actually identified.\nyusheng kuo: Okay, this is the meeting summary complete is an internal word meeting.\nyusheng kuo: So he kind of identified that and he said, okay, we need to fix certain things they are forcing to do.\nyusheng kuo: Right?\nyusheng kuo: And I can email back this agent.\nyusheng kuo: So when they see something, right?\nyusheng kuo: They see something I can email back.\nyusheng kuo: I said, hey, can you tell me which improvement should we prioritize today?\nyusheng kuo: Give me the top five list from the meeting.\nyusheng kuo: And he would just reply me like, what actually should Be done and then you can just continue to say okay then go do it for me.\nyusheng kuo: Like give me the report.\nyusheng kuo: Like help me to set up in the linear and start to let linear agent to go to.\nyusheng kuo: Because we have another one continue to look up for the PR that issue that we need to fix.\nyusheng kuo: So we just like hey okay have a sworn of agent like working constantly in the background.\nyusheng kuo: Because I don't need to go in to comment this once the meeting is finished I have this thing already kind of giving me and then telling me whether the meeting summary, meeting role data, meeting like that here's a meeting role data, here's a summary of the data and also like the agent level summary to give me like a really high level that I only care.\nyusheng kuo: But I already have all the contacts state into my repository and I can talk to my agent.\nyusheng kuo: So that's like if we can kind of deploy this to people like the people again every day the manager can see the report and then they can ask about the report.\nyusheng kuo: Not just like stop that there.\nyusheng kuo: Most of the report will just give you one dashboard give you a report and then you couldn't ask more question.\nyusheng kuo: But now you can just.\nyusheng kuo: So we have.\nyusheng kuo: What I want to say is like what we want to build is the whole infrastructure layer for CAL code.\nyusheng kuo: So one is like a tool layer, right?\nyusheng kuo: We want to let you easily add more tool.\nyusheng kuo: I guess we one click and then this tool set can be portable to everywhere.\nyusheng kuo: And then we also wanted to help you to create a custom tool so you don't get limited to the MCP tool only.\nyusheng kuo: And we want to help you to deploy that.\nyusheng kuo: So it's not local, it's everywhere.\nyusheng kuo: And once it's everywhere we want to build up this kind of communication channel.\nyusheng kuo: Now we only support email, but soon there will be slack everywhere.\nyusheng kuo: So it's like you can one click to decide how you want to be notify when like how you want to be communicating with these agents.\nyusheng kuo: So it could be like within your email.\nyusheng kuo: We like email because I think email is like really scoped.\nyusheng kuo: Like I gave very clear scope.\nyusheng kuo: So like what.\nyusheng kuo: And then the next would be like okay, what about the transaction, the governance, the logging.\nyusheng kuo: So there's like all like this kind of cloud code inference operation layer that you have the kind of domain expertise to know what actually need to be built within that we have the infrastructure like ready to be sold to the customer.\nyusheng kuo: They can start to day two they can start to get the report from the agent and ask question about the agent.\nyusheng kuo: Right?\nyusheng kuo: Even they don't know how to set out everything they can start to interact with them.\nyusheng kuo: Yeah, that's the idea.\nyusheng kuo: Every day they get a fresh report of who should they contact, who's the ae and they see something, they say oh, why this customer?\nyusheng kuo: What's more about them?\nyusheng kuo: And then the agent will go ahead and like try to pull all the relevant data for that particular client.\nyusheng kuo: Say like in the AES perspective.\nyusheng kuo: Right.\nyusheng kuo: It's just like having this like, like you say like you have this idea of.\nyusheng kuo: Oh sorry, I think I lose you.\nyusheng kuo: Right, yeah.\nAndriy Vovchak: No, no, no, I'm here, I'm here, I'm here.\nAndriy Vovchak: Like I. I wanted to ask, I wanted to ask like how.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Like the barrier to entry could be that.\nAndriy Vovchak: To be that, that.\nAndriy Vovchak: For example.\nAndriy Vovchak: Okay, I'm.\nAndriy Vovchak: It's.\nAndriy Vovchak: It's important to understand all the differences between like functions and how they can be used and where they can be put.\nyusheng kuo: Yeah.\nAndriy Vovchak: So this is really important.\nAndriy Vovchak: Like for example that, that is important, important.\nAndriy Vovchak: Like what are the mcps that can be activated?\nyusheng kuo: Yeah, yeah, yeah, yeah.\nAndriy Vovchak: Like this is really like crucial.\nyusheng kuo: You mean like to deploy the agent?\nAndriy Vovchak: Yes, yes, yes, yes.\nyusheng kuo: Yeah, yeah, yeah.\nyusheng kuo: So in terms of skill, every skill can be used directly because skill is just part of the cloud code.\nyusheng kuo: MCP required to be armed data gen so we can authenticate it while we deploy it to cloud.\nyusheng kuo: So as long as the MCP you are using in your agent is through data gen then it will be automatically be added.\nyusheng kuo: So all the other tool like if you added like a Firecraw Supabase Neon audio it will just be automatically be added to your agents capability.\nyusheng kuo: So I treat like MCP as a communication to external service and the skill as like because skill you can even run script right in your cloud code so that those are all the things that you can just directly use it.\nyusheng kuo: So the only barrier is make sure your MCP we try to expand but because now it's a bit complicated set up the authentication.\nyusheng kuo: So we use our gateway to be like authentication layer because so when we deploy that that's easier.\nyusheng kuo: But as long as you are using MCP from data gen then the agent can access all the tool you.\nyusheng kuo: Yeah, yeah, yeah.\nyusheng kuo: So that's the operation layer.\nyusheng kuo: Yeah.\nyusheng kuo: I do want to say we create a shared repository and I will set it up after this meeting and then you can kind of give me the idea and I will go in and create an agent for me for, for you and it would just be a web hook and I can send you as kind of the notification people so you can you can just like send some data there and see the output and I will set up the, the.\nyusheng kuo: The agency.\nAndriy Vovchak: I was about to ask you, can we have a repo, a shared repo where we can push stuff?\nyusheng kuo: Yeah, yeah, yeah.\nyusheng kuo: Let me set it up after this meeting.\nyusheng kuo: Yeah.\nyusheng kuo: Chance could be already there in the 3PO.\nyusheng kuo: Yeah.\nAndriy Vovchak: If you can see.\nAndriy Vovchak: Yeah, yeah, that would be great.\nAndriy Vovchak: And by the way.\nAndriy Vovchak: Yeah.\nAndriy Vovchak: Because I, I need not.\nyusheng kuo: Yeah, yeah.\nyusheng kuo: Sorry for like such a long.\nyusheng kuo: So many.\nAndriy Vovchak: Yeah, it's.\nAndriy Vovchak: It's also like great to understand like how this.\nAndriy Vovchak: Because I have my domain expertise.\nAndriy Vovchak: You have yours.\nyusheng kuo: Is a compliment.\nyusheng kuo: Okay.\nAndriy Vovchak: Yeah, let's, let's.\nAndriy Vovchak: Let's do this way.\nAndriy Vovchak: Let's create the.\nAndriy Vovchak: Set up the repo.\nAndriy Vovchak: If you can send me the transcripts so I can articulate a bit more of the tasks to be done, like in terms of how I think and what are the biggest challenges and how you are really solving them on cloud code.\nAndriy Vovchak: But they need to be articulated, they need to be deployed, they need to be maybe made more explicit to potentially.\nyusheng kuo: Yeah, yeah, exactly.\nAndriy Vovchak: Okay.\nAndriy Vovchak: Okay, my man.\nAndriy Vovchak: I have to.\nAndriy Vovchak: And enjoy your Saturday with your kids, by the way.\nyusheng kuo: Thank you.\nyusheng kuo: Bye.\nyusheng kuo: Take care.\nAndriy Vovchak: Take care.\nTitle: 30 Min Meeting between Yusheng Kuo and Andriy Vovchak\nHost Email: yusheng.kuo@datagen.dev\nOrganizer Email: yusheng.kuo@datagen.dev\nCalendar Id: 2DynJtzPkv3gbBXTsArwCX@Cal.com\nFireflies Users: andriyvovchak15@gmail.com, yusheng.kuo@datagen.dev\nParticipants: andriyvovchak15@gmail.com,yusheng.kuo@datagen.dev, andriyvovchak15@gmail.com\nDate: 1770476400000\nTranscript Url: https://app.fireflies.ai/view/01KGP23TCNBA2HE1SAVCE1WW7Y\nAudio Url: https://cdn.fireflies.ai/01KGP23TCNBA2HE1SAVCE1WW7Y/audio.mp3?Expires=1770698515&Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9jZG4uZmlyZWZsaWVzLmFpLzAxS0dQMjNUQ05CQTJIRTFTQVZDRTFXVzdZL2F1ZGlvLm1wMyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc3MDY5ODUxNX19fV19&Signature=Ay96kDbm~gVnIR6p~N~kEPTYaezNp6tD2rscNKHeGguhdo5ndBFfRLdHtaayHd7wx1Ht-UZwT8IgQTtlwAgC6PEk6iarL74LI2YIb7C3UZrIR5T1ETxN9NY93gFEE2zchCk7oeEyBdEmSqtbBqJ8ykouFXLNvc5Q~JVaGhoSteugIwyRO4MIoV-djQKaZ29kDWTdgOxjEIJxpldrtwuIGGgpCxXAF2c8y-VcTqgKuxO5Rt0hHxysiG5LT1mQYhJmU1nDvXmXKQ4LYh5zeMpRO9bL-uRKPV0VRmq7HxuvHf5KZKaryZviHbAi7plevnUUWoLsPq8sclVfgaDqcC4TVg__&Key-Pair-Id=K25ZJR0UZVF4CM\nVideo Url: No video url\nDuration: 99.7300033569336\nMeeting Attendees: andriyvovchak15@gmail.com, yusheng.kuo@datagen.dev\nCal Id: _6927iriaeht50qrm6djm4gioahpk2sjn8dc40gr1dgn66rrd\nCalendar Type: google\nMeeting Link: https://meet.google.com/sgn-geqm-wdt"
]